
## Plan Result (dev)

[CI link](https://github.com/a-company-jp/digi-baton/actions/runs/13712351951)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 0 to change, 4 to destroy.</code></pre>

* Create
  * azurerm_container_registry.main
* Delete
  * azurerm_container_registry.backend
  * azurerm_container_registry.crypto
  * azurerm_container_registry.external
  * azurerm_container_registry.frontend


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_container_registry.backend will be destroyed
  # (because azurerm_container_registry.backend is not in configuration)
  - resource "azurerm_container_registry" "backend" {
      - admin_enabled                 = false -> null
      - anonymous_pull_enabled        = false -> null
      - data_endpoint_enabled         = false -> null
      - encryption                    = [
          - {
              - enabled            = false
                # (2 unchanged attributes hidden)
            },
        ] -> null
      - export_policy_enabled         = true -> null
      - id                            = "/subscriptions/079243f8-647d-4602-908a-7f755b3dfbcf/resourceGroups/digi-baton/providers/Microsoft.ContainerRegistry/registries/DigiBatonBackendDev" -> null
      - location                      = "japaneast" -> null
      - login_server                  = "digibatonbackenddev.azurecr.io" -> null
      - name                          = "DigiBatonBackendDev" -> null
      - network_rule_bypass_option    = "AzureServices" -> null
      - network_rule_set              = [] -> null
      - public_network_access_enabled = true -> null
      - quarantine_policy_enabled     = false -> null
      - resource_group_name           = "digi-baton" -> null
      - retention_policy              = [
          - {
              - days    = 7
              - enabled = false
            },
        ] -> null
      - sku                           = "Basic" -> null
      - tags                          = {} -> null
      - trust_policy                  = [
          - {
              - enabled = false
            },
        ] -> null
      - zone_redundancy_enabled       = false -> null
        # (2 unchanged attributes hidden)
    }

  # azurerm_container_registry.crypto will be destroyed
  # (because azurerm_container_registry.crypto is not in configuration)
  - resource "azurerm_container_registry" "crypto" {
      - admin_enabled                 = false -> null
      - anonymous_pull_enabled        = false -> null
      - data_endpoint_enabled         = false -> null
      - encryption                    = [
          - {
              - enabled            = false
                # (2 unchanged attributes hidden)
            },
        ] -> null
      - export_policy_enabled         = true -> null
      - id                            = "/subscriptions/079243f8-647d-4602-908a-7f755b3dfbcf/resourceGroups/digi-baton/providers/Microsoft.ContainerRegistry/registries/DigiBatonCryptoDev" -> null
      - location                      = "japaneast" -> null
      - login_server                  = "digibatoncryptodev.azurecr.io" -> null
      - name                          = "DigiBatonCryptoDev" -> null
      - network_rule_bypass_option    = "AzureServices" -> null
      - network_rule_set              = [] -> null
      - public_network_access_enabled = true -> null
      - quarantine_policy_enabled     = false -> null
      - resource_group_name           = "digi-baton" -> null
      - retention_policy              = [
          - {
              - days    = 7
              - enabled = false
            },
        ] -> null
      - sku                           = "Basic" -> null
      - tags                          = {} -> null
      - trust_policy                  = [
          - {
              - enabled = false
            },
        ] -> null
      - zone_redundancy_enabled       = false -> null
        # (2 unchanged attributes hidden)
    }

  # azurerm_container_registry.external will be destroyed
  # (because azurerm_container_registry.external is not in configuration)
  - resource "azurerm_container_registry" "external" {
      - admin_enabled                 = false -> null
      - anonymous_pull_enabled        = false -> null
      - data_endpoint_enabled         = false -> null
      - encryption                    = [
          - {
              - enabled            = false
                # (2 unchanged attributes hidden)
            },
        ] -> null
      - export_policy_enabled         = true -> null
      - id                            = "/subscriptions/079243f8-647d-4602-908a-7f755b3dfbcf/resourceGroups/digi-baton/providers/Microsoft.ContainerRegistry/registries/DigiBatonExternalDev" -> null
      - location                      = "japaneast" -> null
      - login_server                  = "digibatonexternaldev.azurecr.io" -> null
      - name                          = "DigiBatonExternalDev" -> null
      - network_rule_bypass_option    = "AzureServices" -> null
      - network_rule_set              = [] -> null
      - public_network_access_enabled = true -> null
      - quarantine_policy_enabled     = false -> null
      - resource_group_name           = "digi-baton" -> null
      - retention_policy              = [
          - {
              - days    = 7
              - enabled = false
            },
        ] -> null
      - sku                           = "Basic" -> null
      - tags                          = {} -> null
      - trust_policy                  = [
          - {
              - enabled = false
            },
        ] -> null
      - zone_redundancy_enabled       = false -> null
        # (2 unchanged attributes hidden)
    }

  # azurerm_container_registry.frontend will be destroyed
  # (because azurerm_container_registry.frontend is not in configuration)
  - resource "azurerm_container_registry" "frontend" {
      - admin_enabled                 = false -> null
      - anonymous_pull_enabled        = false -> null
      - data_endpoint_enabled         = false -> null
      - encryption                    = [
          - {
              - enabled            = false
                # (2 unchanged attributes hidden)
            },
        ] -> null
      - export_policy_enabled         = true -> null
      - id                            = "/subscriptions/079243f8-647d-4602-908a-7f755b3dfbcf/resourceGroups/digi-baton/providers/Microsoft.ContainerRegistry/registries/DigiBatonFrontendDev" -> null
      - location                      = "japaneast" -> null
      - login_server                  = "digibatonfrontenddev.azurecr.io" -> null
      - name                          = "DigiBatonFrontendDev" -> null
      - network_rule_bypass_option    = "AzureServices" -> null
      - network_rule_set              = [] -> null
      - public_network_access_enabled = true -> null
      - quarantine_policy_enabled     = false -> null
      - resource_group_name           = "digi-baton" -> null
      - retention_policy              = [
          - {
              - days    = 7
              - enabled = false
            },
        ] -> null
      - sku                           = "Basic" -> null
      - tags                          = {} -> null
      - trust_policy                  = [
          - {
              - enabled = false
            },
        ] -> null
      - zone_redundancy_enabled       = false -> null
        # (2 unchanged attributes hidden)
    }

  # azurerm_container_registry.main will be created
  + resource "azurerm_container_registry" "main" {
      + admin_enabled                 = false
      + admin_password                = (sensitive value)
      + admin_username                = (known after apply)
      + encryption                    = (known after apply)
      + export_policy_enabled         = true
      + id                            = (known after apply)
      + location                      = "japaneast"
      + login_server                  = (known after apply)
      + name                          = "DigiBaton"
      + network_rule_bypass_option    = "AzureServices"
      + network_rule_set              = (known after apply)
      + public_network_access_enabled = true
      + resource_group_name           = "digi-baton"
      + retention_policy              = (known after apply)
      + sku                           = "Basic"
      + trust_policy                  = (known after apply)
      + zone_redundancy_enabled       = false
    }

Plan: 1 to add, 0 to change, 4 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"run-terraform-plan","PRNumber":34,"Program":"tfcmt","SHA1":"01dfb3abb55228faced872a9f0ce4ddfbc1bc98c","Target":"dev","Vars":{},"WorkflowName":"[Infra] Run terragrunt plan on PR submission"} -->